{"transformers_version": "5.13.1", "architectures": ["HYV3ForCausalLM"], "output_hidden_states": false, "return_dict": true, "dtype": "float32", "chunk_size_feed_forward": 0, "is_encoder_decoder": false, "id2label": {"0": "LABEL_0", "1": "LABEL_1"}, "label2id": {"LABEL_0": 0, "LABEL_1": 1}, "problem_type": null, "vocab_size": 256, "hidden_size": 128, "intermediate_size": 64, "num_hidden_layers": 5, "num_attention_heads": 4, "num_key_value_heads": 2, "head_dim": 32, "hidden_act": "silu", "max_position_embeddings": 4096, "initializer_range": 0.006, "rms_norm_eps": 1e-05, "use_cache": true, "pad_token_id": null, "bos_token_id": null, "eos_token_id": null, "tie_word_embeddings": false, "attention_bias": false, "attention_dropout": 0.0, "mlp_bias": false, "num_experts": 8, "num_experts_per_tok": 2, "num_shared_experts": 1, "moe_intermediate_size": 32, "router_scaling_factor": 2.826, "enable_moe_fp32_combine": true, "mlp_layer_types": ["dense", "sparse", "sparse", "sparse", "sparse"], "output_router_logits": false, "rope_parameters": {"rope_type": "default", "rope_theta": 10000.0}, "_name_or_path": "", "first_k_dense_replace": 1, "route_norm": true, "moe_router_use_sigmoid": true, "moe_router_enable_expert_bias": true, "qk_norm": true, "model_type": "hy_v3", "output_attentions": false}