{"transformers_version": "5.14.1", "architectures": ["Qwen3_5MoeForCausalLM"], "output_hidden_states": false, "return_dict": true, "dtype": "float32", "chunk_size_feed_forward": 0, "is_encoder_decoder": false, "id2label": {"0": "LABEL_0", "1": "LABEL_1"}, "label2id": {"LABEL_0": 0, "LABEL_1": 1}, "problem_type": null, "vocab_size": 512, "hidden_size": 128, "num_hidden_layers": 4, "num_attention_heads": 4, "num_key_value_heads": 2, "hidden_act": "silu", "max_position_embeddings": 4096, "initializer_range": 0.02, "rms_norm_eps": 1e-06, "use_cache": true, "tie_word_embeddings": false, "rope_parameters": {"rope_type": "default", "rope_theta": 10000000, "mrope_interleaved": true, "mrope_section": [2, 1, 1], "partial_rotary_factor": 0.25}, "attention_bias": false, "attention_dropout": 0.0, "head_dim": 32, "linear_conv_kernel_dim": 4, "linear_key_head_dim": 16, "linear_value_head_dim": 16, "linear_num_key_heads": 2, "linear_num_value_heads": 4, "moe_intermediate_size": 32, "shared_expert_intermediate_size": 32, "num_experts_per_tok": 2, "num_experts": 8, "output_router_logits": false, "router_aux_loss_coef": 0.001, "layer_types": ["linear_attention", "linear_attention", "linear_attention", "full_attention"], "pad_token_id": null, "bos_token_id": null, "eos_token_id": null, "_name_or_path": "qwen36_tiny", "model_type": "qwen3_5_moe_text", "full_attention_interval": 4, "attn_output_gate": true, "partial_rotary_factor": 0.25, "mamba_ssm_dtype": "float32", "norm_topk_prob": true, "mtp_num_hidden_layers": 0, "output_attentions": false}